k-gumus/tepecan_maskot/yazilim/esp32/sdkconfig.defaults
# ESP32-S3-DevKitC-1 N16R8: 16 MB flash, 8 MB oktal PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Ses tamponları ve TTS WAV'ı PSRAM'de duruyor; yığın buna göre.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# Harici besleme/pille açılışta USB beklememesi için CDC kapalı.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
